system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    bottle
    {
        type triSurfaceMesh;
        file "bottle.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells       2000000;
    maxGlobalCells      4000000;
    minRefinementCells  0;
    nCellsBetweenLevels 2;

    // Required in OF13
    resolveFeatureAngle 30;

    features
    (
        { file "bottle.eMesh"; level 2; }
    );

    refinementSurfaces
    {
        bottle
        {
            level (2 3);
            patchInfo
            {
                type wall;
            }
        }
    }

    // point inside the bottle fluid region
    locationInMesh (0 0 0.10);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 5;
    tolerance    2.0;
    nSolveIter   50;
    nRelaxIter   5;

    nFeatureSnapIter       10;
    implicitFeatureSnap    false;
    explicitFeatureSnap    true;
    multiRegionFeatureSnap true;
}

meshQualityControls
{
    maxNonOrtho           70;
    maxBoundarySkewness   20;
    maxInternalSkewness   4;
    maxConcave            80;

    minVol                1e-13;
    minTetQuality         1e-9;

    // The ones it complained about / will likely want:
    minArea               -1;
    minTwist              0.02;
    minDeterminant        0.001;
    minTriangleTwist      -1;

    minFaceWeight         0.02;
    minVolRatio           0.01;

    nSmoothScale          4;
    errorReduction        0.75;
}

mergeTolerance 1e-6;
