constant/physicalProperties.air
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.air;
}

viscosityModel constant;

rho     rho [1 -3 0 0 0 0 0]  1.2;     // kg/m3
nu      nu  [0 2 -1 0 0 0 0]  1.5e-05; // m2/s

