constant/physicalProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.water;
}

viscosityModel constant;

rho     rho [1 -3 0 0 0 0 0]  980;     // soju-ish density ~0.98 g/cm3

nu      nu  [0 2 -1 0 0 0 0]  1.5e-06; // ~1.5 cSt kinematic viscosity

