0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottle
    {
        // bottle wall moves according to solidBodyMotionFvMesh / fvMeshMover
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}
